{
  "home": {
    "title": "W3Cay - Weird Wonder Web Cay",
    "description": "W3Cay is a fun web cay collecting weird and useless websites. Discover random website and explore endless quirky wonders across the digital world.",
    "keywords": "weird websites, fun websites, bored button, useless website, random website, W3Cay"
  },
  "about": {
    "title": "About Us",
    "description": "W3Cay is an \"island of interests\" dedicated to collecting and sharing interesting websites, tools, games and AI experiences, bringing inspiration and joy to your daily life.",
    "keywords": "about us, website introduction, team introduction, website philosophy, W3Cay, island of interests"
  },
  "contact": {
    "title": "Contact Us",
    "description": "Contact the W3Cay team for support, feedback, or collaboration opportunities. We are committed to providing you with the best website discovery experience.",
    "keywords": "contact us, website feedback, collaboration, technical support, W3Cay, website discovery"
  },
  "submit": {
    "title": "Submit Website",
    "description": "Submit interesting, weird or useless websites to W3Cay. Share the amazing websites you discovered and let more people explore the interesting corners of the digital world.",
    "keywords": "submit website, recommend site, share website, interesting websites, W3Cay, website sharing"
  },
  "terms": {
    "title": "Terms of Service",
    "description": "W3Cay Terms of Service. Learn about your rights and obligations when using our website. We are committed to providing a transparent and fair service experience.",
    "keywords": "terms of service, terms of use, website terms, legal terms, W3Cay, website usage"
  },
  "privacy": {
    "title": "Privacy Policy",
    "description": "W3Cay Privacy Policy. Learn how we collect, use, and protect your personal information. We value your privacy rights.",
    "keywords": "privacy policy, data protection, personal information, privacy rights, W3Cay, data security"
  },
  "disclaimer": {
    "title": "Disclaimer",
    "description": "W3Cay Disclaimer. Learn about our disclaimers regarding third-party content. We are committed to providing accurate and legal website information.",
    "keywords": "disclaimer, legal notice, third-party content, disclaimers, W3Cay, legal information"
  },
  "blogs": {
    "title": "Blog Posts",
    "description": "Read blog posts about programming, technology and more topics. Share my thoughts, tutorials and stories.",
    "keywords": "blog, tech articles, programming tutorials, development experience, tech sharing, W3Cay blog",
    "featuredPosts": "Featured Posts",
    "recentPosts": "Recent Posts",
    "viewAll": "view all",
    "readMore": "Read More"
  }
}
